# 12 类装甲板检测（仅 bbox，无关键点）— 与 Roboflow YOLO 导出标签一致
nc: 12
depth_multiple: 0.33
width_multiple: 0.25

anchors:
  - [12,10, 19,14, 26,20]
  - [37,31, 61,46, 88,68]
  - [113,105, 193,108, 245,149]

backbone:
  [[-1, 1, CBRM, [32]],
   [-1, 1, Shuffle_Block, [128, 2]],
   [-1, 3, Shuffle_Block, [128, 1]],
   [-1, 1, Shuffle_Block, [256, 2]],
   [-1, 7, Shuffle_Block, [256, 1]],
   [-1, 1, Shuffle_Block, [512, 2]],
   [-1, 3, Shuffle_Block, [512, 1]],
  ]
head:
  [[-1, 1, SPPFCSPC, [512, 5]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C2f, [512]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 2], 1, Concat, [1]],
    [-1, 3, C2f, [256]],
    [-1, 1, SimAM, [256]],
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 10], 1, Concat, [1]],
    [-1, 3, C2f, [512]],
    [-1, 1, SimAM, [512]],
    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 7], 1, Concat, [1]],
    [-1, 3, C2f, [1024]],
    [-1, 1, SimAM, [1024]],
    [[13, 17, 21], 1, Detect, [nc, anchors]],
  ]
